[
    {
        "name": "Парсинг базы данных и проведение расчетов с ней на языке Python",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/parsing-bazy-dannyh-i-provedenie-raschetov-s-nej-na-yazyke-python-1119799/",
        "time": {
            "type": "Открыт",
            "timeAgo": "18 дней назад",
            "date": "21.07.2021 в 09:30"
        },
        "bidsCount": "9 заявок",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Цель\r\nДля целей создания базы данных и проведения дальнейших расчетов с ней необходим код на языке Python, который выполняет следующие функции:\r\n•Загружает данные (excel + парсинг/ скрэппинг данных из интернет);\r\n•Производит необходимые расчеты на основании загруженных данных;\r\n•Выгружает результат расчетов в виде таблицы (Excel)\r\nРезультатом является выгружаемая таблица данных, ранжированных по интегральной оценке, складывающейся из оценок по 4 показателям. \r\nСроки и стоимость\r\nСтоимость: обсуждаема\r\nСрок выполнения работ: Код должен быть готов к полноценному функционированию к 6 августа 2021 года"
    },
    {
        "name": "Нужно парсить",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/nuzhno-parsit-1119681/",
        "time": {
            "type": "Открыт",
            "timeAgo": "19 дней назад",
            "date": "20.07.2021 в 15:18"
        },
        "bidsCount": "4 заявки",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужно парсить линию из одного сайта бк на другой, но чтобы было возможность делать ставки <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a> от сюда брать линию, апи и поставить их на <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>"
    },
    {
        "name": "Парсинг коэффициентов букмекера",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/parsing-koeffitcientov-bukmekera-1119676/",
        "time": {
            "type": "Открыт",
            "timeAgo": "19 дней назад",
            "date": "20.07.2021 в 15:00"
        },
        "bidsCount": "1 заявка",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Добрый день, необходимо парсить коэффициенты букмекеров по линии и live матчи. Нужно будет оценить возможность парсинга с сайта букмекера bet365.com\r\nПримерно 1000 матчей нужно будет обновлять в линии (актуальность коэффициентов около 10 минут), и live режим, там изменения коэффициента происходят примерно раз 10-15 секунд. (около 100 матчей одновременно к примеру может быть).\r\nЭти данные (коэффициенты и виды ставок) необходимо будет записывать в базу, чтобы потом сайт/приложение брало себе их из базы.\r\nДумал, на счет того чтобы допустим на облачные сервера закидывать парсинг и чтобы там себе автоматически парсило и обновляло.\r\nНо, все упирается в возможности.\r\nЕще как вариант:\r\nЧеловек заходит в матч, отправляется запрос в парсинг, ждет несколько секунд пока подгружаются коэффициенты.Те, допустим, он зашел первый в этот матч, загрузились коэффициенты на этот матч, они записались в базу и считаются актуальными 10 минут. Следующий человек который зайдет в этот же матч в течении 10 минут, получает уже коэффициенты из базы. Ну а если вышел срок актуальности (10 мин), то коэффициент подгружаются заново.\r\nНужно найти решение задачи)"
    },
    {
        "name": "Парсинг резюме",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/parsing-rezyume-1119218/",
        "time": {
            "type": "Открыт",
            "timeAgo": "22 дня назад",
            "date": "16.07.2021 в 17:58"
        },
        "bidsCount": "3 заявки",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Интересует парсинг резюме соискателей работы с соответствующих сайтов о работе. - Ищем специалиста со своими аакаунтами - Пример подборки по вакансии предоставляем  (ссылка на необходимую вакансию с заданными параметрами) - В среднем за раз по заказу 300-1000 контактов, бывает больше - Срок исполнения 1-2 дня - Оплата переводом   - Также, просьба указывать стоимость одного контакта в зависимости от объема\r\nГотовый файл необходимо выгрузить в эксель."
    },
    {
        "name": "Разработка Телеграм бота",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/razrabotka-telegram-bota-1119128/",
        "time": {
            "type": "Открыт",
            "timeAgo": "23 дня назад",
            "date": "16.07.2021 в 08:40"
        },
        "bidsCount": "3 заявки",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Здравствуйте!\r\n------------------------\r\nНужно создать Бот-парсер в Телеграм \r\nСтоимость - обсуждается!\r\nПодписываем договор.\r\nЗадача бота: \r\n*парсинг открытых чатов по заданным критериям и передача (копирование) текста на основной аккаунт. \r\nБез опыта НЕ откликаться! Только для кодеров и разрабов, которые сами делают. \r\nВсе детали обсудим с исполнителем, как и стоимость сотрудничества.\r\nОсобым преимуществом будет наличие готовых, рабочих примеров ботов!"
    },
    {
        "name": "Парсер на Python",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-na-python-1119078/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "15.07.2021 в 16:43"
        },
        "bidsCount": "12 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужен парсер, который будет брать ссылки на новости с текстового файла, все ссылки с одного источника. Заходить в каждую\r\nновость брать оттуда всю информацию о видео и записывать ее в текстовый файл.\r\nТакже скрипт должен уметь склеивать несколько картинок в одну и загружать это\r\nизображение на хостинг картинок, брать с хостинга ссылку на изображение и\r\nвставлять в текстовый документ в нужное место. Скрипт должен также находить\r\nссылку для скачивания с другого текстового файла, а если не может найти, то\r\nпредлагать внести вручную."
    },
    {
        "name": "Cпарсить тематики с указанных мною сайтов",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/cparsit-tematiki-s-ukazannyh-mnoyu-sajtov-1119075/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "15.07.2021 в 16:21"
        },
        "bidsCount": "9 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Требуется партнер, кто сможет  cпарсить данные по тематикам с нескольких указанных мною сайтов, на постоянной основе.\r\nРабота строится так : вы парсите информацию, я ее покупаю по заранее обговоренной цене.\r\nКуплю любые объемы ,пишите."
    },
    {
        "name": "Спарсить контент с сайта на вордпрессе",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/sparsit-kontent-s-sajta-na-vordpresse-1119027/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "15.07.2021 в 13:03"
        },
        "bidsCount": "10 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Задача - спарсить контент статей с сайта на вордпрессе и залить его на новый сайт. Т.е. забираем с целевого сайта: текст статьи с оформлением, картинки и миниатюру записи. Заливаем это в чистый сайт на WP. Объем - несколько тысяч статей. Основная сложность - целевой сайт как-то защищен от парсинга. \r\nУрл донора пришлю в личку, оставляйте пожалуйста свои отклики с ценой и сроком исполнения проекта. Заранее благодарен!"
    },
    {
        "name": "Выполнить чертежи проекта сауны и хаммам.",
        "url": "https://weblancer.net/projects/chertezhi-i-shemy-78/vypolnit-chertezhi-proekta-sauny-i-hammam-1118972/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "15.07.2021 в 07:20"
        },
        "bidsCount": "2 заявки",
        "amount": "Цена не указана",
        "type": "Чертежи и Схемы",
        "description": "Нужен конструктор для разработки комплект чертежей для монтажа сауны и хаммам по готовому дизайн-проекту.\r\nСпецифические знания не требуется. При разработке выдадим всю необходимую информацию для выполнения работы, тк довольно узкая сфера.\r\nИмеются наброски, готовые пироги отделки, большинство узлов, планировка, развертки помещений. Для выполнения требуется минимальное представление о металлических и деревянных конструкциях. При обсуждении предоставим готовые проекты для образца.\r\nЗанимаемся строительством спа (бани, хаммамы и пр), требуется специалист для долговременного сотрудничества, сами не успеваем всё делать.\r\nПримерный объём: планы, разрезы, узлы, бетонный подиум с нишами, пол, перегородки, усиление для остекления, примыкание потолка и лобика с подсветкой, металлокаркас лавок и стены, спецификация.\r\nБюджет подлежит обсуждению.\r\nКандидаты без портфолио не рассматриваются! Прикладывайте примеры Обязательно."
    },
    {
        "name": "Привет, есть много работы, парсинг. Жду контакты. Спасибо",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/privet-est-mnogo-raboty-parsing-zhdu-kontakty-spasibo-1118964/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "14.07.2021 в 22:20"
        },
        "bidsCount": "1 заявка",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Привет, есть много работы, парсинг, можем обсудить. Жду контакты. Спасибо"
    },
    {
        "name": "Написать парсер с выводом данных в файл.",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/napisat-parser-s-vyvodom-dannyh-v-fajl-1118882/",
        "time": {
            "type": "Открыт",
            "timeAgo": "25 дней назад",
            "date": "14.07.2021 в 14:47"
        },
        "bidsCount": "2 заявки",
        "amount": {
            "USD": "$100",
            "RUB": "7 425 руб",
            "UAH": "2 783 грн"
        },
        "type": "Веб-программирование",
        "description": "Парсить данные нужно с 1 сервиса встроенное в гугл-хром расширение, и с 3 сайтов. Всего нужно спарсить около 18 переменных для\r\nпрограммы (их количество может поменяться в ходе написания программы, но\r\nнезначительно). 13-17 переменных с сервиса через гугл-хром расширение.\r\nОставшиеся 3 переменных с 3 разных сайтов. Парсер должен собрать данные,\r\nпровести с ними простые операции, и удобно вывести в файл для дальнейшей работы\r\nс ними.\r\n Я вам запишу на видео, откуда какие переменные брать, а вы уж сами должны изучить все нюансы для работы. Я предоставлю к нему доступ (к\r\nрасширению), для полного знакомства с ним. С сайтов какие данные парсить – я\r\nтоже записал видео, там всё просто.\r\n В общем более детальный разбор я надеюсь провести через звонки + показать через anydesk что откуда брать.\r\n ВНИМАНИЕ! Я добавил видеозапись того, что нужно сделать, чтобы каждому не разжёвывать. Пожалуйста, просмотрите видео до конца, там\r\nважная информация. Спасибо.\r\nВидео 1\r\nВидео 2"
    },
    {
        "name": "Laravel",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/laravel-1118785/",
        "time": {
            "type": "Открыт",
            "timeAgo": "25 дней назад",
            "date": "13.07.2021 в 21:20"
        },
        "bidsCount": "1 заявка",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Необходима натяжка и программная часть сайта на Laravel\r\nТип сайта: сайт каталог\r\nСложные компоненты: фильтр\r\nИнтеграции: парсинг данных, интеграция по API\r\nРабота для middel level\r\nПросьба всегда быть на связи по возможности и самое главное соблюдать сроки"
    },
    {
        "name": "Парсер API данных ФМС (FMS)",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-api-dannyh-fms-fms-1118713/",
        "time": {
            "type": "Открыт",
            "timeAgo": "26 дней назад",
            "date": "13.07.2021 в 13:28"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Добрый день! Не подскажете стоимость парсера?"
    },
    {
        "name": "Парсер / Грабер с Xenforo на Xenforo",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-graber-s-xenforo-na-xenforo-1118661/",
        "time": {
            "type": "Открыт",
            "timeAgo": "26 дней назад",
            "date": "13.07.2021 в 02:39"
        },
        "bidsCount": "3 заявки",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужен парсер, который будет работать с CMS Xenforo: парсить темы с одного сайта на другой. Авторизуемся на одном форуме, чтобы видеть скрытый текст в темах и парсим на свой форум.\r\nКартинки загружаем на свой форум, на который парсим темы.\r\nДолжна быть возможность выбора тем, которые мы опубликуем на своём форуме.\r\nПример: выбираем сайт откуда парсить (можно просто указывать URL на раздел), происходит парсинг всех тем из указанного раздела на свой форум. \r\nПеред публикацией их на своём форуме, должен быть выбор: какие темы публиковать, а\r\nкакие отложить.\r\nЕсли у кого-то уже есть готовый/аналогичный парсер, можно договориться о покупке."
    },
    {
        "name": "Написать парсер",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/napisat-parser-1118496/",
        "time": {
            "type": "Открыт",
            "timeAgo": "27 дней назад",
            "date": "12.07.2021 в 08:59"
        },
        "bidsCount": "9 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Добрый день. Нужно доработать парсер, подключить к телеграм боту, и все это залить на vds сервер."
    },
    {
        "name": "Специалист по Logstash, Elastic, Kibana",
        "url": "https://weblancer.net/projects/sistemnoe-programmirovanie-24/spetcialist-po-logstash-elastic-kibana-1118375/",
        "time": {
            "type": "Открыт",
            "timeAgo": "28 дней назад",
            "date": "10.07.2021 в 18:35"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Системное программирование",
        "description": "Требуется специалист с опытом работы с Logstash, Elastic, Kibana.Задача состоит в добавлении к существующему индеку дополнительных полей и модификация конфига Logstash под эти цели, также создани пошаговой инструкции по установке Logstash, Elastic, Kibana с последующим созданием индекса в Elastic и конфигом для Logstash для парсинга  входящих в json событий. Оплата почасовая, возможен аргументированный выход за пределы бюджета, в приоритете длительное сотрудничество."
    },
    {
        "name": "Подружить Node js и Wordpress или другой CMS",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/podruzhit-node-js-i-wordpress-ili-drugoj-cms-1118345/",
        "time": {
            "type": "Открыт",
            "timeAgo": "24 дня назад",
            "date": "15.07.2021 в 12:17"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Доброго дня.\r\nЕсть сервер с сайтом на wordpress и приложение написанное на Node js. Приложение парсит информацию с блокчейнов и сторонних API, переделывает в нужный формат и выводит на своих страницах результат. Также, есть возможность подключения к приложению крипто-кошелька metamask и взаимодействие с ним.\r\nНеобходимо сделать, чтобы все фронтенд страницы приложения Node js отображались на стороне wordpress и пользователь мог с ними взаимодействовать посредством своего кошелька metamask.\r\nВ приложении есть несколько статичных страниц и динамические с выводом информации парсера. Важно, чтобы на стороне wordpress можно было для них прописать SEO заголовки и дискрипшин.\r\nТо есть, задать шаблон формирования SEO метатегов (можно с помощью плагина Yoast SEO).\r\nПредложить оптимальный способ решения проблемы. \r\nТакже, подойдет решение не на основе Wordpress.\r\nМожет бы не отображать файлы приложения в wordpress, а например передавать данные в сам wordpress и там собирать в базу и отображать.\r\nКандидатам вышлю подробное тз.\r\nСтоимость работы и сроки называете сами. Если сработаемся - то будут постоянные заказы.\r\nРаботаем через безопасную сделку или оплата после выполнения заказа, без предоплаты."
    },
    {
        "name": "Доработать модуль Битрикс по интеграции с SimaLand",
        "url": "https://weblancer.net/projects/internet-magaziny-61/dorabotat-modul-bitriks-po-integratcii-s-simaland-1118134/",
        "time": "Закрыт",
        "bidsCount": "2 заявки",
        "amount": "Цена не указана",
        "type": "Интернет-магазины",
        "description": "Примерное ТЗ:\r\nЕсть рабочий модуль <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>\r\nК примеру рассмотрим товар: <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>\r\nМой сайт: <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>\r\nНужный функционал по окончанию работ над модулем:\r\nФункционал по созданию всей структуры каталога товаров sima-land.ru на нашем сайте\r\nФункционал по обновлению(добавлению) новый категорий, который нет у нас на сайте (проверка по id)\r\nФункционал по обновлению каталога товаров (цена, описание и другие, возможные позиции), по sid сравнивает значения, есть различия? Меняет на значения с sima-land.ru\r\nФункционал по созданию всех  брендов\\торговых марок с сайта sima-land.ru, с логотипами, для того-чтобы парсить данные и подставлять эти значения у нас на сайте\r\nФункционал по парсингу всевозможных характеристик товара (общие, упаковка и фасовка, габариты и вес, особенности), так-же если нет каких-либо характеристик у нас на сайте, досоздать их\r\nПринцип работы модуля:\r\nСоздание всех категорий – модуль парсит все категории sima-land.ru, создает аналогичные\r\nОбновление всех категорий (сделать крон, который будет запускаться раз в день, ночью) – модуль парсит категории из sima-land.ru, сравнивает с нашими по id, при наличии новых создаёт их в нужном месте\r\nСоздание всех товаров из sima-land.ru – модуль предлагает выбрать сколько товаров за раз, переодичность, таймаут и тд (часть функционала уже есть)\r\nОбновление всех товаров (сделать крон, который будет запускаться раз в день, ночью) – модуль парсит поочередно все товары и обновляет, в случае различий"
    },
    {
        "name": "Laravel developer",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/laravel-developer-1117848/",
        "time": {
            "type": "Открыт",
            "timeAgo": "28 дней назад",
            "date": "11.07.2021 в 10:16"
        },
        "bidsCount": "9 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Необходима натяжка и программная часть сайта на Laravel \r\nТип сайта: сайт каталог \r\nСложные компоненты: фильтр \r\nИнтеграции: парсинг данных, интеграция по API \r\nРабота для middel level \r\nПросьба всегда быть на связи по возможности и самое главное соблюдать сроки \r\nНе беритесь за работу если не уверены в своих силах и свободном времени \r\nМакеты в ЛС \r\nПо необходимости будет написано ТЗ под ваши требования и всячески будет оказываться поддержка для комфортной работы\r\nПрошу показать примеры работ сайтов каталогов на laravel"
    },
    {
        "name": "Восстановление сайта на WA с web.archive.org",
        "url": "https://weblancer.net/projects/napolnenie-sajtov-35/vosstanovlenie-sajta-na-wa-s-web-archive-org-1103008/",
        "time": {
            "type": "Открыт",
            "timeAgo": "12 дней назад",
            "date": "27.07.2021 в 13:21"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Наполнение сайтов",
        "description": "Через парсинг и загрузку с web.archive.org или иными автоматическими методами, но ТОЛЬКО не в ручном режиме.\r\nНеобходимо выкачать и восстановить контентное наполнение ресурса prof-kom.ru\r\nЦМС - WebAsyst (ShopScript)\r\n=================================================\r\n В личку писать свои предложения не нужно (эти сообщения будут \r\n проигнорированы, и в рамках тендера рассматриваться не будут). В рамках \r\n тендера пожалуйста указывайте свою цену и сроки. Предложения без цены не\r\n  рассматриваются. Обращения иными методами коммуникации, кроме сообщений\r\n  в тендере, не рассматриваются и игнорируются. В личную почту принимаем \r\n только сообщения относительно технических деталей проекта.\r\n Оплата WebMoney или на карту. Другие валюты и ПС по согласованию.\r\n Предложения \"БЕЗОПАСНЫХ СДЕЛОК\" нами не рассматриваются.\r\n Никаких предоплат (ни полных, ни частичных). Оплата исключительно по факту выполненной работы.\r\n Если исполнитель не согласен на данное условие, то не нужно выставлять \r\n свою кандидатуру, отвлекая мое время на его оценку. На иных, кроме \r\n озвученных выше условиях мы не согласимся."
    },
    {
        "name": "Парсер цен из маркетплейса яндекс маркета",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-tcen-iz-marketplejsa-yandeks-marketa-1120893/",
        "time": {
            "type": "Открыт",
            "timeAgo": "10 дней назад",
            "date": "28.07.2021 в 18:13"
        },
        "bidsCount": "5 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Парсить нужно маркетплейс яндекс.маркета, товары я укажу отдельноссылкассылкассылка"
    },
    {
        "name": "Разработать сервис на php",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/razrabotat-servis-na-php-1120889/",
        "time": {
            "type": "Открыт",
            "timeAgo": "10 дней назад",
            "date": "28.07.2021 в 17:44"
        },
        "bidsCount": "2 заявки",
        "amount": {
            "USD": "$50",
            "RUB": "3 713 руб",
            "UAH": "1 392 грн"
        },
        "type": "Веб-программирование",
        "description": "Нужно сделать похожий сервис для youtube. ru.savefrom.net\r\nЧто нужно сделать:\r\n1. Юзер вводит ссылку с ютуба, скрипт заходит на ютуб и парсит данные для скачивания и возвращает пользователю картинка, ссылка на файлы.\r\n2. Запрос должен идти на backend асинхронный.\r\n3. Подключить Redis, если уже запрашивалась эта ссылка отдавать данные из редиса.\r\n4.На беке должен быть Laravel или другой фреймворк и css фреймворк.\r\nТребования, php 7 или 8, redis, curl.\r\nПишите если Вас устраивают условия и задание."
    },
    {
        "name": "Хочу узнать цену! Парсер",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/hochu-uznat-tcenu-parser-1120770/",
        "time": {
            "type": "Открыт",
            "timeAgo": "11 дней назад",
            "date": "28.07.2021 в 10:39"
        },
        "bidsCount": "5 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужно сделать парсер который будет\r\n1) Автоматом парсить контент - видео\r\n2) Парсить описание  ( переписывать текст доводить до униклаьности)\r\n3) Выявлять ключевые слова и прописывать их\r\nЕсть одна идея, нужно понять такое вообще реально и если да то какова цена. Всем спасибо кто откликнется."
    },
    {
        "name": "ТЗ на разработку парсинга для сайта по авиабилетам",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/tz-na-razrabotku-parsinga-dlya-sajta-po-aviabiletam-1120715/",
        "time": {
            "type": "Открыт",
            "timeAgo": "11 дней назад",
            "date": "27.07.2021 в 20:19"
        },
        "bidsCount": "4 заявки",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "ТЗ на разработку парсинга для сайта по авиабилетам\r\nСайт на CS Cart\r\nЧто нам нужно:\r\n    У нас есть страницы - Город Вылета-Город прилета их IATA-код\r\nНам нужно для каждой страницы получать контент с сайта которые предоставляет эти данные по API и записывать эти данные в sql таблицу раз в день по крону чтобы были всегда актуальные данные. Возможно есть другое решение, но не генерировать при загрузке страницы решили потому что будет долгая загрузка контента и могут быть ошибки при выводе контента.\r\nЯ вижу эту систему так. Есть файл на сервере который запрашивает данные - полученные данные записывает в нужную ячейку таблицы (ее код это код вылета-код прилета) то есть в общем очень удобно в этом плане организована таблицы и ничего сопоставлять не нужно будет.\r\nВсего таких страниц для которых нужно будет запрашивать и потом записывать данные\r\n220 000 шт.\r\nСсылка на ТЗ<a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>"
    },
    {
        "name": "Парсинг аудитории с Instagram TikTok",
        "url": "https://weblancer.net/projects/sotcialynye-seti-smm-i-smo-89/parsing-auditorii-s-instagram-tiktok-1120658/",
        "time": {
            "type": "Открыт",
            "timeAgo": "12 дней назад",
            "date": "27.07.2021 в 15:20"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Социальные сети (SMM и SMO)",
        "description": "Задание.\r\n1. Нужно напарсить живую аудиторию с инфлюэнсеров определнной категории- Аудитория должна быть обязательно с США\r\n2. Разослать сообщения с возможностью продолжения диалога."
    },
    {
        "name": "Добавление ACF custom fields с одного WordPress сайта на другой",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/dobavlenie-acf-custom-fields-s-odnogo-wordpress-sajta-na-drugoj-1120548/",
        "time": {
            "type": "Открыт",
            "timeAgo": "12 дней назад",
            "date": "26.07.2021 в 17:48"
        },
        "bidsCount": "5 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "На двух WordPress сайтах есть около 200 одинаковых постов. На главном сайте (пусть будет сайт1) через плагин ACF добавлены custom fields с featured image и заголовком поста на этом изображении. На сайте2 есть контент этих постов, но нет этих custom fields.\r\nНеобходимо добавить эти два custom fields с сайта1 на сайт2. При этом URL соотв-х постов на сайте1 и сайте2 одинаковые за исключением наличия \"/blog/\" на сайте1.\r\nЯ вижу решение примерно таким:\r\n1) Получить URLы или сами файлы featured image через какой-либо парсер или выбрав его из экспортного XML файла. \r\n2) custom fields с заголовком поста можно взять из XML или просто скопировать название поста\r\n3) Через API плагина ACF ( <a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a> ) добавить эти значения на сайт2.\r\nПри этом ACF поля требуют уникального ключа:<a class=\"dotted text-muted\" data-toggle=\"tooltip\" title=\"Перейдите в заказ, чтобы видеть ссылки.\">ссылка</a>\r\nЕсли у вас есть какие-либо попроще идеи (например через XML импорты-экспорты) - с удовольствием выслушаю в комментариях к заявке.\r\nPS: Нужные custom fields выглядят так в экспортном XML файле:\r\n﻿                     <wp:postmeta>\r\n      <wp:meta_key><!]></wp:meta_key>\r\n      <wp:meta_value><!]></wp:meta_value>\r\n      </wp:postmeta>\r\n                     <wp:postmeta>\r\n      <wp:meta_key><!]></wp:meta_key>\r\n      <wp:meta_value><!]></wp:meta_value>\r\n      </wp:postmeta>\r\n                     <wp:postmeta>\r\n      <wp:meta_key><!]></wp:meta_key>\r\n      <wp:meta_value><!]></wp:meta_value>\r\n      </wp:postmeta>\r\n                     <wp:postmeta>\r\n      <wp:meta_key><!]></wp:meta_key>\r\n      <wp:meta_value><!]></wp:meta_value>\r\n      </wp:postmeta>"
    },
    {
        "name": "Парсинг Данных",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/parsing-dannyh-1120472/",
        "time": {
            "type": "Открыт",
            "timeAgo": "13 дней назад",
            "date": "26.07.2021 в 12:36"
        },
        "bidsCount": "7 заявок",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Нужно создать базу e-mail. Детали опишу в личку"
    },
    {
        "name": "Нужен парсер",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/nuzhen-parser-1120419/",
        "time": {
            "type": "Открыт",
            "timeAgo": "13 дней назад",
            "date": "26.07.2021 в 08:59"
        },
        "bidsCount": "8 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужен парсер новых анкет с сайта badoo.com и импорт их на мой сайт."
    },
    {
        "name": "Игровой лаунчер",
        "url": "https://weblancer.net/projects/prikladnoe-po-23/igrovoj-launcher-1120361/",
        "time": {
            "type": "Открыт",
            "timeAgo": "14 дней назад",
            "date": "25.07.2021 в 13:54"
        },
        "bidsCount": "3 заявки",
        "amount": {
            "USD": "$500",
            "RUB": "37 125 руб",
            "UAH": "13 915 грн"
        },
        "type": "Прикладное ПО",
        "description": "Необходимо разработать игровой-десктоп лаунчер со следующим функционалом:\r\n- Верстка с анимациями;\r\n- Авто-обновление лаунчера;\r\n- Скачивание игровых файлов;\r\n- Проверка игровых файлов перед каждым запуском;\r\n- Обновление игровых файлов;\r\n- Запуск игры с параметрами;\r\n- Счетчик онлайна у каждого сервера;\r\n- Парсинг новостей с ВК;\r\n- Пополнение счета через вебапи (unitpay обработчик);\r\n- Настройка всех ссылок по дизайну;\r\n- Улучшенная графика в настройках (скачивание определенных файлов если она включена, и если выключена то удалять определенные файлы).\r\n- Исправление проблем со входом в настройках (удаление одного файла это просто);\r\n- Переустановка игры в настройках (запуск первоначального процесса установи с удалением текущих файлов)\r\n- Выбор папки с игрой в настройках (это на случай если человек хочет переместить игру)\r\nПримечание: игра должна устанавливаться в директорию без русских символов."
    },
    {
        "name": "Парсер товаров али экпресс в файл эксель",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-tovarov-ali-ekpress-v-fajl-eksel-1120342/",
        "time": {
            "type": "Открыт",
            "timeAgo": "14 дней назад",
            "date": "25.07.2021 в 09:49"
        },
        "bidsCount": "4 заявки",
        "amount": {
            "USD": "$100",
            "RUB": "7 425 руб",
            "UAH": "2 783 грн"
        },
        "type": "Веб-программирование",
        "description": "Нужно создать парсер для товаров сайта али экпресс который будет выгружать выбранные товары в документ xls по правилам алиэкспресс. Шаблон в прикрепленном файле"
    },
    {
        "name": "Написать программу",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/napisat-programmu-1120335/",
        "time": {
            "type": "Открыт",
            "timeAgo": "14 дней назад",
            "date": "25.07.2021 в 06:09"
        },
        "bidsCount": "2 заявки",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Задача: У меня есть таблица. В ней много строк вниз и много в бок. Для самого экселя это очень непростая задача - держать всё в одной книге или на одном листе. Кроме того я постоянно что-то добавляю и мне приходится использовать функции, которые еще больше перегружают таблицу. Мне бы хотелось сделать что-то простое в облаке. Пример таблицы во вложении.\r\nВ самом начале кадастровый номер как правило - это номер здания. Но по каким-то зданиям мне нужно, чтобы при нажатии на кадастровый номер здания выпадал список кадастровых номеров помещений. Как на картинке во вложении.\r\nНа данный момент основная работа ведется в Экселе с помощью формулы ВПР.\r\nТак же необходимо, чтобы была реализована функция внесения данных. Например, в эту таблицу мне необходимо добавить данные иди обновить. Я загружаю данные из Эксель по принципу - в первой строке таблицы Эксель искомое значение (которое ищется в основной таблице), а во второй\\третьей\\итакдалее значение, которое необходимо внести\\заменить.\r\nВсё это должно быть с функцией фильтрации и выгрузке по какому-то значению. Так же чтобы была возможность сообщаться по API. Есть несколько парсингов, которые будут интегрированы в эту таблицу."
    },
    {
        "name": "Сайт на фреймворке + парсер с большой нагрузкой",
        "url": "https://weblancer.net/projects/sajty-pod-klyuch-58/sajt-na-frejmvorke-parser-s-bolyshoj-nagruzkoj-1120258/",
        "time": {
            "type": "Открыт",
            "timeAgo": "15 дней назад",
            "date": "23.07.2021 в 22:16"
        },
        "bidsCount": "11 заявок",
        "amount": {
            "USD": "$1000",
            "RUB": "74 250 руб",
            "UAH": "27 830 грн"
        },
        "type": "Сайты «под ключ»",
        "description": "Парсим амазон, выводим на сайт с фильтрами.\r\nЕсть ТЗ, оставляйте ТЕЛЕГРАМ"
    },
    {
        "name": "Обход cloudflare",
        "url": "https://weblancer.net/projects/prikladnoe-po-23/obhod-cloudflare-1120221/",
        "time": {
            "type": "Открыт",
            "timeAgo": "6 дней назад",
            "date": "02.08.2021 в 13:55"
        },
        "bidsCount": "4 заявки",
        "amount": "Цена не указана",
        "type": "Прикладное ПО",
        "description": "Нужна консультация как обойти cloudflare анти-бот систему при парсинге на python"
    },
    {
        "name": "Парсинг",
        "url": "https://weblancer.net/projects/bazy-dannyh-25/parsing-1120166/",
        "time": {
            "type": "Открыт",
            "timeAgo": "16 дней назад",
            "date": "23.07.2021 в 12:47"
        },
        "bidsCount": "нет заявок",
        "amount": "Цена не указана",
        "type": "Базы данных",
        "description": "Парсинг базы застройщиков с сайта наш дом"
    },
    {
        "name": "Парсинг сайта на TypeScript",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parsing-sajta-na-typescript-1120157/",
        "time": {
            "type": "Открыт",
            "timeAgo": "16 дней назад",
            "date": "23.07.2021 в 11:25"
        },
        "bidsCount": "3 заявки",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужно на криптобирже получать курсы монет и оперативно обновлять их. Сама биржа работает на TypeScript\r\nСрок выполнения работы- около 3 дней (чем быстрее, тем лучше)"
    },
    {
        "name": "Парсер подписчиков и лайков на постах в инстаграм. На Python",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-podpischikov-i-lajkov-na-postah-v-instagram-na-python-1119961/",
        "time": {
            "type": "Открыт",
            "timeAgo": "17 дней назад",
            "date": "21.07.2021 в 23:23"
        },
        "bidsCount": "10 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Создать бота на Python который будет парсить подписчиков по хештегу и проверять лайки на постах в Инстаграм"
    },
    {
        "name": "Написание парсера",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/napisanie-parsera-1119948/",
        "time": {
            "type": "Открыт",
            "timeAgo": "17 дней назад",
            "date": "21.07.2021 в 21:19"
        },
        "bidsCount": "1 заявка",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Написание парсера Мне нужно чтобы от сюда 7777.MD линииа спорт было на pol24.net"
    },
    {
        "name": "Парсер продуктового сайта",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-produktovogo-sajta-1119904/",
        "time": {
            "type": "Открыт",
            "timeAgo": "18 дней назад",
            "date": "21.07.2021 в 16:49"
        },
        "bidsCount": "6 заявок",
        "amount": {
            "USD": "$40",
            "RUB": "2 970 руб",
            "UAH": "1 113 грн"
        },
        "type": "Веб-программирование",
        "description": "Нужно написать приложение для развертывания на сервере, выполняющее периодический парсинг сайта silpo.ua (с возможностью в дальнейшем добавлять новые сайты) (обновляя базу). Также, для ускорения процесса потребуется распределение на несколько потоков (с возможным подключением прокси). На выходе ожидается база со следующим набором колонок:\r\n 1. Айди товара;\r\n 2. Название товара;\r\n 3. Категория товара;\r\n 4. Магазин (в данном случае - Сильпо);\r\n 5. Адрес магазина;\r\n 6. Вес/количество/объем;\r\n 7. Единицы измерения (граммы/штуки/милилитры);\r\n 8. Фото;\r\n 9. Наличие по указанному адресу;\r\n 10. Дата, время обновления данных. \r\n Для проверки требуется предоставление пробной бд и самого скрипта."
    },
    {
        "name": "Парсер",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/parser-1119871/",
        "time": {
            "type": "Открыт",
            "timeAgo": "18 дней назад",
            "date": "21.07.2021 в 14:35"
        },
        "bidsCount": "8 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Нужно сделать сканер, который сможет сканировать коэффициенты в разных букмекерских конторах и сравнивать их между собой для поиска арбитражной ситуации(вилки). Вилка - это заработок на ставках на противоположные события. То есть я делаю ставки в двух разных конторах на один и тот же матч на противоположные исходы и в любом случае одна из ставок выигрывает. Примеры сайтов: parimatch.ru, olimp.bet, ggbet.ru\r\nУ меня есть исходники на питоне на  парсинг 2 букмекерских контор (1xstavka.ru, fonbet.ru). Нужно добавить ещё несколь несколько сайтов + сделать сайт, куда будут выводиться вилки.\r\nПодробнее в ЛС.\r\nВозможно дальнейшее сотрудничество."
    },
    {
        "name": "Нужно сделать к нему дополнение Yii",
        "url": "https://weblancer.net/projects/veb-programmirovanie-31/nuzhno-sdelat-k-nemu-dopolnenie-yii-1119860/",
        "time": {
            "type": "Открыт",
            "timeAgo": "13 дней назад",
            "date": "26.07.2021 в 15:52"
        },
        "bidsCount": "5 заявок",
        "amount": "Цена не указана",
        "type": "Веб-программирование",
        "description": "Скрипт на php для интеграции в существующий сайт на Yii.\r\nЦель: взаимодействие с API сервиса himera-search.info.\r\nПротокол взаимодействия:\r\nна входе имеется txt файл с email, он подается скрипту через интерфейс сайта. Успешность/неуспешность загрузки отображается.\r\nСкрипт пишет данные в базу. При последующих запусках скрипта, перед отправкой запроса к API он проверяет наличие email в базе,\r\nесли email есть - запрос по нему не отправляется.\r\nСкрипт в табличной форме выводит на отдельной странице сайта (добавить пункт меню) инфо в формате:\r\nemail, ФИО, дата рождения, телефон, VK*, Telegram*, Instagram*, Facebook*.\r\nВсего выводить 100 результатов вне зависимости от количества email  в файле.\r\nСкрипт парсит выдачу и выводит в таблицу только те ответы на запросы где имеются\r\nвсе параметры без звездочки, если их не достаточно (>100), выбирает наиболее полную информацию - где больше данных. \r\nТ.е. VK* + Telegram* + Instagram* выводится раньше чем Telegram* + Instagram*\r\nОписание API есть на сайте. Необходимо учитывать тайминги.\r\nРабота на прямую"
    }
]